cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "bagonyi/homebrew-formulae"
tap "my/casks"

brew "fish"
brew "git"
brew "git-secrets"
brew "jq"
brew "tree"
brew "watch"
brew "wget"
brew "mecab"
brew "mecab-ipadic"
brew "leveldb@1.22"
brew "docker-compose"
brew "openjdk@17"
#brew "openjdk@8"
brew "minikube"
brew "gradle"
brew "helm"
brew "ffmpeg"
brew "mysql-client"
brew "eksctl"
brew "awscli"
brew "mkcert"
brew "nginx"
brew "unar"
brew "huggingface-cli"
brew "nmap"
brew "mas"
brew "gcc"
brew "portaudio"
brew "openal-soft"
brew "mise"
brew "direnv"
brew "aws-nuke"
brew "git-filter-repo"
brew "powerline-go"
brew "cmake"

cask "font-ricty-diminished"
cask "gcloud-cli"
cask "appcleaner"
cask "aws-vault-binary"
cask "docker-desktop"
cask "google-chrome"
cask "notion"
cask "notion-mail"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "grammarly-desktop"
cask "deepl"
cask "ngrok"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
#cask "temurin@8"
cask "adobe-creative-cloud"
#cask "tableau"
cask "chromium"
#cask "tableau-prep"
cask "balsamiq-wireframes"
cask "postman"
cask "nordvpn"
cask "adobe-acrobat-pro"
cask "chatgpt"
cask "proxyman"
cask "mitmproxy"
cask "figma"
cask "microsoft-teams"
cask "webcatalog"
cask "intellij-idea-ce"
cask "cameracontroller"
cask "elgato-stream-deck"
cask "tidal"
cask "altair-graphql-client"
cask "wasabi-wallet"
cask "mactex"
cask "genspark-ai-browser"
cask "superwhisper"
cask "claude"
cask "codex"
